Revit 2026 API

# WorksetTableGetActiveWorksetId Method

---

Returns the active workset's WorksetId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetId GetActiveWorksetId()
```
```vb
Public Function GetActiveWorksetId As WorksetId
```
```cpp
public:
WorksetId^ GetActiveWorksetId()
```
```fsharp
member GetActiveWorksetId : unit -> WorksetId
```

#### Return Value

WorksetId WorksetId of the active workset.

#### Reference

WorksetTable Class

Autodesk.Revit.DB Namespace